
create_clock -period 30.000 -name virtual_clock -waveform {0.000 15.000}
create_clock -period 30.000 -name clk -waveform {0.000 15.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.750 [get_ports {instruction[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {instruction[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.750 [get_ports stallSig]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports stallSig]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {funct[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {funct[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {immediate[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {immediate[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {opcode[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {opcode[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {rd[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {rd[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {rs[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {rs[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {rt[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {rt[*]}]
